settings.org
* Overview
This is my init rewrite. A vanilla init.el was getting out of control and
maybe going back to a literate style with org will help. If this gets to be
annoying (for instance not being able to just eval buffer) I can always try
outline mode.

This is a work in progress (but isn't every init?). I'm not sure everything works like it did in my old
init (nor am I sure I want it to). So not everything is likely to be 100% yet.

* TODOS
** TODO Line numbers don't show up in org mode.
** TODO better organization

* Basics
** OS X
   I'm used to things a certain way. Also, unlike a lot of Emacs users I
   prefer to use CapsLock as meta instead of Ctrl. Which I set via the
   OSX pref pane. The original reason for that was that on mechanical
   keyboards dropping the your hand and hitting Ctrl was easy, now it's
   just habit.

  #+begin_src emacs-lisp
    (setq mac-option-modifier 'meta)
    (setq mac-command-modifier 'super)
    (setq mac-pass-command-to-system 't)

    (define-key global-map [?\s-v] 'yank)
    (define-key global-map [?\s-c] 'kill-ring-save)
    (define-key global-map [?\s-x] 'kill-region)

    (setq select-enable-clipboard t)
  #+end_src
** Set Up A Convenient way to get to my config file
  #+begin_src emacs-lisp
    (defconst *install-dir* "~/jjgemacs/")

    (defun find-config ()
      "Edit config.org"
      (interactive)
      (find-file (concat *install-dir* "settings.org")))

    (global-set-key (kbd "C-c I") 'find-config)
  #+end_src

** Sensible Defaults
   Eventually I need to customize this and pull the defaults I actually
   care about into this init rather than relying on whatever version of
   sensible defaults I used the last time I reworked this file.

   For now I've checked in that version and I'll continue to use it as is:

  #+begin_src emacs-lisp
    (load-file (concat *install-dir* "sensible-defaults.el"))
    (sensible-defaults/use-all-settings)
    (sensible-defaults/use-all-keybindings)
    (sensible-defaults/backup-to-temp-directory)
  #+end_src

** Some Initial UI Changes

   Getting rid of some of the default ui elements that just get in the way: tool
   bar, menu bar, scroll bar, and a mini scrollbar that appears in minibuffers.

  #+begin_src emacs-lisp
    (tool-bar-mode 0)
    (menu-bar-mode 0)
    (scroll-bar-mode -1)

    (set-window-scroll-bars (minibuffer-window) nil nil)
  #+end_src

** Package Management
*** Straight
    Going to attempt to use straight this time around.

  #+begin_src emacs-lisp
    (defvar bootstrap-version)
    (let ((bootstrap-file
	   (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
	  (bootstrap-version 5))
      (unless (file-exists-p bootstrap-file)
	(with-current-buffer
	    (url-retrieve-synchronously
	     "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
	     'silent 'inhibit-cookies)
	  (goto-char (point-max))
	  (eval-print-last-sexp)))
      (load bootstrap-file nil 'nomessage))
  #+end_src

  Integrate with use-package

  #+begin_src emacs-lisp
    (straight-use-package 'use-package)
  #+end_src

** Look and feel
   Pull in doom themes to use the bold, italic, and doom-vibrant.

  #+begin_src emacs-lisp
    (use-package doom-themes
      :straight t
      :config
      (progn
	(setq doom-themes-enable-bold t
	      doom-themes-enable-italic t)
	(load-theme 'doom-vibrant t)))
  #+end_src

  hl-line highlights the line at current point

  #+begin_src emacs-lisp
    (use-package hl-line
      :straight t
      :config
      (global-hl-line-mode))
  #+end_src

  Rainbow delimeters, always.

  #+begin_src emacs-lisp
    (use-package rainbow-delimiters
      :straight t)
  #+end_src
** All the icons
#+begin_src emacs-lisp
  (use-package all-the-icons
    :straight t)
#+end_src
** Projectile
#+begin_src emacs-lisp
  (use-package projectile
    :straight  t
    :config
    (projectile-global-mode)
    (setq projectile-enable-caching t))
#+end_src

Some additional bindings.
#+begin_src emacs-lisp
  (global-set-key (kbd "C-c p p") #'projectile-switch-project)
  (global-set-key (kbd "C-c p f") #'projectile-find-file)
  (global-set-key (kbd "C-c p t") #'projectile-toggle-between-implementation-and-test)
#+end_src
** Search
ag for searching

Make sure The [[https://github.com/ggreer/the_silver_searcher][Silver Searcher]] is installed.
#+begin_src emacs-lisp
  (use-package ag
    :straight t
    :commands (ag ag-regexp ag-project))
#+end_src

Binding to use ag for project grep.
#+begin_src emacs-lisp
(global-set-key (kbd "C-c p s g") #'ag-project)
#+end_src
** In Buffer Completion
Company mode for completions.
#+begin_src emacs-lisp
  (use-package company
    :straight t)
  (global-company-mode)
#+end_src

*** TODO slime company mode
** Emacs Completion Framework
I'm still using Helm though another stab at Ivy could be in the near future.
#+begin_src emacs-lisp
  (defun helm-hide-minibuffer-maybe ()
    (when (with-helm-buffer helm-echo-input-in-header-line)
      (let ((ov (make-overlay (point-min) (point-max) nil nil t)))
        (overlay-put ov 'window (selected-window))
        (overlay-put ov 'face (let ((bg-color (face-background 'default nil)))
                                `(:background ,bg-color :foreground ,bg-color)))
        (setq-local cursor-type nil))))

  (use-package helm
    :straight t
    :bind (("M-x" . helm-M-x)
           ("C-x C-f" . helm-find-files)
           ("C-x f" . helm-recentf)
           ("M-y" . helm-show-kill-ring)
           ("C-x b" . helm-buffers-list))
    :bind (:map helm-map
                ("M-i" . helm-previous-line)
                ("M-k" . helm-next-line)
                ("M-I" . helm-previous-page)
                ("M-K" . helm-next-page)
                ("M-h" . helm-beginning-of-buffer)
                ("M-H" . helm-end-of-buffer)
                ("TAB" . helm-execute-persistent-action)
                ("<tab>" . helm-execute-persistent-action)
                ("C-z" . helm-select-action))
    :config (progn
              (setq helm-buffers-fuzzy-matching t)
              (setq helm-echo-input-in-header-line t)
              (add-hook 'helm-minibuffer-set-up-hook 'helm-hide-minibuffer-maybe)
              (helm-mode 1)))

  (use-package helm-descbinds
    :straight t
    :bind ("C-h b" . helm-descbinds))

  (use-package helm-swoop
    :straight t
    :bind (("M-m" . helm-swoop)
           ("M-M" . helm-swoop-back-to-last-point))
    :init
    (bind-key "M-m" 'helm-swoop-from-isearch isearch-mode-map))

  (use-package helm-ag
    :straight helm-ag
    :bind ("M-p" . helm-projectile-ag)
    :commands (helm-ag helm-projectile-ag)
    :init (setq helm-ag-insert-at-point 'symbol
                helm-ag-command-option "--path-to-ignore ~/.agignore"))

   (use-package helm-company
     :straight t)

  (use-package helm-projectile
    :straight t
    :config
    (helm-projectile-on))
#+end_src
** Dashboard
I don't really end up using the dashboard, but I'm going to keep it for now.
#+begin_src emacs-lisp
  (use-package dashboard
    :straight t
    :config
    (dashboard-setup-startup-hook)
    (setq dashboard-set-heading-icons t)
    (setq dashboard-set-file-icons t)
    (setq dashboard-items '((recents . 5)
                            (projects . 10)
                            (bookmarks . 5))))
#+end_src
** Key Chord mode
Key chord lets me define quick key presses to call functions. This just pulls in
the package, there will be a `key-chord-define-global` in the appropriate
sections.

#+begin_src emacs-lisp
  (use-package key-chord
    :straight t
    :config (key-chord-mode 1))
#+end_src
** Popwin
Popwin handles the annoying pop up buffers.
#+begin_src emacs-lisp
  (use-package popwin
    :straight t
    :config
    (setq display-buffer-alist '((popwin:display-buffer-condition popwin:display-buffer-action))))
#+end_src
** Modeline
*** Doom modeline
#+begin_src emacs-lisp
  (use-package doom-modeline
    :straight t
    :hook (after-init . doom-modeline-mode)
    :init
    (setq doom-modeline-minor-modes (featurep 'minions)))
#+end_src
*** Minions
Provides a dropdown menu in the modeline.
#+begin_src emacs-lisp
  (use-package minions
    :straight t
    :config (minions-mode 1))
#+end_src
** Misc
A bunch of stuff that was sitting around loose in my old init. I should review
these to see what should stay and what shouldn't.

#+begin_src emacs-lisp
  (save-place-mode 1)
  (set-default 'truncate-lines 1)
  (setq ring-bell-function 'ignore)
  (winner-mode t)
  (blink-cursor-mode -1)

  (add-hook 'prog-mode-hook 'display-line-numbers-mode)
  (setq fci-rule-column 100)
#+end_src

*** Paren mode with better highlighting
I'm not sure this is even strictly necessary but since it was in the old init
I'll keep it.
#+begin_src emacs-lisp
  (require 'paren)
  ;;(set-face-background 'show-paren-match "#aaaaaa")
  (set-face-foreground 'show-paren-match "#f54949")
  (set-face-attribute 'show-paren-match nil :weight 'extra-bold)
#+end_src

*** Backup and Save Management
Why did I do this? I don't know, but I don't want to get rid of it until I
remember.
#+begin_src emacs-lisp
  (setq backup-directory-alist
        `((".*" . ,temporary-file-directory)))
  (setq auto-save-file-name-transforms
        `((".*", temporary-file-directory t)))
#+end_src
* General Tools
** Restclient Mode
*** TODO Double check that this works and that the jq portion works now that I've moved it over.

Can't live without restclient mode, way too useful.

#+begin_src emacs-lisp
  (use-package restclient
    :straight (restclient :type git :host github :repo "pashky/restclient.el"))
#+end_src

Restclient jq doesn't come with the package in melpa so we need a separate recipe for that.

#+begin_src emacs-lisp
  (use-package restclient-jq
    :straight (restclient-jq :type git :host github :repo "pashky/restclient.el"))
#+end_src

#+begin_src emacs-lisp
  (add-to-list 'auto-mode-alist '("\\.restclient\\'" . restclient-mode))
#+end_src
** Ace Window
Window switching made easy via Ace Window.

#+begin_src emacs-lisp
  (use-package ace-window
    :straight t)
  (setq aw-keys '(?a ?s ?d ?f ?g ?h ?j ?k ?l))

  (key-chord-define-global "ww" 'ace-select-window)
#+end_src
