settings.el
(setq mac-option-modifier 'meta)
(setq mac-command-modifier 'super)
(setq mac-pass-command-to-system 't)

(define-key global-map [?\s-v] 'yank)
(define-key global-map [?\s-c] 'kill-ring-save)
(define-key global-map [?\s-x] 'kill-region)

(setq select-enable-clipboard t)

(defconst *install-dir* "~/jjgemacs/")

(defun find-config ()
  "Edit config.org"
  (interactive)
  (find-file (concat *install-dir* "settings.org")))

(global-set-key (kbd "C-c I") 'find-config)

(load-file (concat *install-dir* "sensible-defaults.el"))
(sensible-defaults/use-all-settings)
(sensible-defaults/use-all-keybindings)
(sensible-defaults/backup-to-temp-directory)

(tool-bar-mode 0)
(menu-bar-mode 0)
(scroll-bar-mode -1)

(set-window-scroll-bars (minibuffer-window) nil nil)

(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
      (bootstrap-version 5))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
	(url-retrieve-synchronously
	 "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
	 'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))

(straight-use-package 'use-package)

(use-package doom-themes
  :straight t
  :config
  (progn
    (setq doom-themes-enable-bold t
	  doom-themes-enable-italic t)
    (load-theme 'doom-vibrant t)))

(use-package hl-line
  :straight t
  :config
  (global-hl-line-mode))

(use-package rainbow-delimiters
  :straight t)

(use-package all-the-icons
  :straight t)

(use-package projectile
  :straight  t
  :config
  (projectile-global-mode)
  (setq projectile-enable-caching t))

(global-set-key (kbd "C-c p p") #'projectile-switch-project)
(global-set-key (kbd "C-c p f") #'projectile-find-file)
(global-set-key (kbd "C-c p t") #'projectile-toggle-between-implementation-and-test)

(use-package ag
  :straight t
  :commands (ag ag-regexp ag-project))

(global-set-key (kbd "C-c p s g") #'ag-project)

(use-package company
  :straight t)
(global-company-mode)

(defun helm-hide-minibuffer-maybe ()
  (when (with-helm-buffer helm-echo-input-in-header-line)
    (let ((ov (make-overlay (point-min) (point-max) nil nil t)))
      (overlay-put ov 'window (selected-window))
      (overlay-put ov 'face (let ((bg-color (face-background 'default nil)))
                              `(:background ,bg-color :foreground ,bg-color)))
      (setq-local cursor-type nil))))

(use-package helm
  :straight t
  :bind (("M-x" . helm-M-x)
         ("C-x C-f" . helm-find-files)
         ("C-x f" . helm-recentf)
         ("M-y" . helm-show-kill-ring)
         ("C-x b" . helm-buffers-list))
  :bind (:map helm-map
              ("M-i" . helm-previous-line)
              ("M-k" . helm-next-line)
              ("M-I" . helm-previous-page)
              ("M-K" . helm-next-page)
              ("M-h" . helm-beginning-of-buffer)
              ("M-H" . helm-end-of-buffer)
              ("TAB" . helm-execute-persistent-action)
              ("<tab>" . helm-execute-persistent-action)
              ("C-z" . helm-select-action))
  :config (progn
            (setq helm-buffers-fuzzy-matching t)
            (setq helm-echo-input-in-header-line t)
            (add-hook 'helm-minibuffer-set-up-hook 'helm-hide-minibuffer-maybe)
            (helm-mode 1)))

(use-package helm-descbinds
  :straight t
  :bind ("C-h b" . helm-descbinds))

(use-package helm-swoop
  :straight t
  :bind (("M-m" . helm-swoop)
         ("M-M" . helm-swoop-back-to-last-point))
  :init
  (bind-key "M-m" 'helm-swoop-from-isearch isearch-mode-map))

(use-package helm-ag
  :straight helm-ag
  :bind ("M-p" . helm-projectile-ag)
  :commands (helm-ag helm-projectile-ag)
  :init (setq helm-ag-insert-at-point 'symbol
              helm-ag-command-option "--path-to-ignore ~/.agignore"))

 (use-package helm-company
   :straight t)

(use-package helm-projectile
  :straight t
  :config
  (helm-projectile-on))

(use-package dashboard
  :straight t
  :config
  (dashboard-setup-startup-hook)
  (setq dashboard-set-heading-icons t)
  (setq dashboard-set-file-icons t)
  (setq dashboard-items '((recents . 5)
                          (projects . 10)
                          (bookmarks . 5))))

(use-package key-chord
  :straight t
  :config (key-chord-mode 1))

(use-package popwin
  :straight t
  :config
  (setq display-buffer-alist '((popwin:display-buffer-condition popwin:display-buffer-action))))

(use-package doom-modeline
  :straight t
  :hook (after-init . doom-modeline-mode)
  :init
  (setq doom-modeline-minor-modes (featurep 'minions)))

(use-package minions
  :straight t
  :config (minions-mode 1))

(save-place-mode 1)
(set-default 'truncate-lines 1)
(setq ring-bell-function 'ignore)
(winner-mode t)
(blink-cursor-mode -1)

(add-hook 'prog-mode-hook 'display-line-numbers-mode)
(setq fci-rule-column 100)

(require 'paren)
;;(set-face-background 'show-paren-match "#aaaaaa")
(set-face-foreground 'show-paren-match "#f54949")
(set-face-attribute 'show-paren-match nil :weight 'extra-bold)

(setq backup-directory-alist
      `((".*" . ,temporary-file-directory)))
(setq auto-save-file-name-transforms
      `((".*", temporary-file-directory t)))

(use-package restclient
  :straight (restclient :type git :host github :repo "pashky/restclient.el"))

(use-package restclient-jq
  :straight (restclient-jq :type git :host github :repo "pashky/restclient.el"))

(add-to-list 'auto-mode-alist '("\\.restclient\\'" . restclient-mode))

(use-package ace-window
  :straight t)
(setq aw-keys '(?a ?s ?d ?f ?g ?h ?j ?k ?l))

(key-chord-define-global "ww" 'ace-select-window)
