settings.org
** Org Mode

   First things first, require org tempo to get the easy templates back. This
   enables stuff like '<s tab' to create source blocks.

  #+begin_src emacs-lisp
    (require 'org-tempo)
  #+end_src

  Org bullets please.
  #+begin_src emacs-lisp
    (use-package org-bullets
      :straight t
      :config
      (add-hook 'org-mode-hook #'org-bullets-mode))
  #+end_src

  #+begin_src emacs-lisp
    (add-hook 'org-mode-hook 'org-indent-mode)
  #+end_src

  Org Babel setup. I haven't checked that all these work when moving to this new
  init. Also that ob-restclient load can probably be handle better.

  #+begin_src emacs-lisp

    (use-package ob-go
    :straight t)
      ;; TODO TEMPORARY I need a solution for managing non-package elisp files
    ;; this requires manually putting the restclient code in the search path
    ;; TODO this can probably be a gitsubmodule
    (load-file (concat *install-dir* "ob-restclient.el"))
    (require 'ob-restclient)
    (require 'ob-go)
    (require 'ob-clojure)
    (require 'ob-js)
    (require 'ob-groovy)

    (with-eval-after-load 'org
      (org-babel-do-load-languages 'org-babel-load-languages
                                                           '((shell		.	t)
                                                             (lisp		.	t)
                                                             (clojure	.	t)
                                                             (sql		.	t)
                                                             (python	.	t)
                                                             (go		.	t)
                                                             (js		.	t)
                                                             (restclient	.	t)
                                                             (groovy        .       t))))

    (setq org-babel-clojure-backend 'cider)

  #+end_src

*** Logging done in org mode
#+begin_src emacs-lisp
  (setq org-log-done 'time)
#+end_src

** Magit
#+begin_src emacs-lisp
  (use-package magit
    :straight t
    :bind (("C-x g" . magit-status)))
#+end_src

Controlling how magit status opens.
#+begin_src emacs-lisp
  (setq magit-display-buffer-function
        (lambda (buffer)
          (display-buffer
           buffer (if (and (derived-mode-p 'magit-mode)
                           (memq (with-current-buffer buffer major-mode)
                                 '(magit-process-mode
                                   magit-revision-mode
                                   magit-diff-mode
                                   magit-stash-mode
                                   magit-status-mode)))
                      nil
                    '(display-buffer-same-window)))))
#+end_src
** Git Gutter
#+begin_src emacs-lisp
  (use-package git-gutter+
    :straight t
    :init (global-git-gutter+-mode))
#+end_src
** Exec path from shell
Use the system env variables in Emacs.

#+begin_src emacs-lisp
  (use-package exec-path-from-shell
    :straight t
    :config
    (when (memq window-system '(mac ns x))
      (exec-path-from-shell-initialize)))
#+end_src

** Which Key
Gives you that pop up showing completions for partially entered commands.
#+begin_src emacs-lisp
  (use-package which-key
   :straight t)
  (which-key-mode)
  (which-key-setup-minibuffer)
#+end_src

** Avy
Jump around the buffer by key press.

#+begin_src emacs-lisp
  (use-package avy
    :straight t
    :bind (("C-'" . avy-goto-char-timer)
           ("C-:" . avy-goto-line)))

  (key-chord-define-global "sf" 'avy-goto-char-2)
#+end_src
** Midnight Mode
Runs the CleanBufferList but can run arbitrary code.
#+begin_src emacs-lisp
  (require 'midnight)
  (midnight-delay-set 'midnight-delay "12:00am")
#+end_src
** YA Snippet
I included ya snippet in my last config, but never really dug in. Keeping it
because I'm pretty sure it'll be useful.
#+begin_src emacs-lisp
  (use-package yasnippet
    :straight t
    :config
    (yas-global-mode 1))
#+end_src
** Deft
Not sure I want to use this anymore but I'm going to keep it for now.
#+begin_src emacs-lisp
  (use-package deft
    :straight t
    :config
    (setq deft-directory "~/notes")
    (setq def-recursive t)
    (setq deft-auto-save-interval 300.0)
    (setq deft-org-mode-title-prefix t)
    (setq deft-use-filename-as-title t)
    (setq deft-default-extension "org"))
#+end_src
** Ox Hugo
I was using this to manage my blog, which still exists, but since I didn't take
good notes on how I ran it I need to come back to this and make sure everything
still works.
#+begin_src emacs-lisp
  (use-package ox-hugo
    :straight t
    :after ox)
#+end_src
** How Do You
This is supposed to help you search across the various SO type sites to get
answers. I should use it more or delete it.
#+begin_src emacs-lisp
  (use-package howdoyou
    :straight t)
#+end_src
** Free Keys
Shows what key bindings are open in a particular mode.

#+begin_src emacs-lisp
  (use-package free-keys
    :straight t)
#+end_src
** Docker
#+begin_src emacs-lisp
  (use-package dockerfile-mode
    :straight t
    :mode "\\Dockerfile*//")
#+end_src
** Dumb Jump
Let's give dumb jump a try again.
#+begin_src emacs-lisp
  (use-package dumb-jump
    :straight t)
#+end_src
** UUID
I'm probably going to want to implement these myself at some point but for now
leveraging a lib on github will work. Provides a variety of functions but I'm
grabbing it mainly just to insert a random uuid into a buffer.
#+begin_src emacs-lisp
  (use-package uuidgen
    :straight (uuidgen :type git :host github :repo "kanru/uuidgen-el"))
#+end_src
* Languages
** General
*** Smart Parens
#+begin_src emacs-lisp
  (use-package smartparens
    :straight t)

  (require 'smartparens-config)
#+end_src

Bindings that shouldn't be global but are for now.
#+begin_src emacs-lisp
  (global-set-key (kbd "C-)") 'sp-forward-slurp-sexp) ;; this shouldn't be always set but for now if it gets me going
  (global-set-key (kbd "M-s") 'sp-splice-sexp)
#+end_src
*** JSON
Extends the built in javascript mode iirc.
#+begin_src emacs-lisp
  (use-package json-mode
    :straight t)
#+end_src
*** Yaml
#+begin_src emacs-lisp
  (use-package yaml-mode
    :straight t
    :mode ("\\.ya?ml\\'" . yaml-mode))
#+end_src
*** Markdown
#+begin_src emacs-lisp
  (use-package markdown-mode
    :straight t
    :mode ("\\.md\\'" . markdown-mode))
#+end_src
*** LSP Mode
Installing this to experiment with Kotlin but likely to use elsewhere.
#+begin_src emacs-lisp
  (use-package lsp-mode
    :commands (lsp lsp-deferred)
    :straight t
    :init (setq lsp-keymap-prefix "C-c l")
    :config (lsp-enable-which-key-integration t))
#+end_src
*** GraphQL
#+begin_src emacs-lisp
  (use-package graphql-mode
    :straight t)
#+end_src
** Lisp
*** Slime
#+begin_src emacs-lisp
  (use-package slime
    :straight t
    :config
    (setq inferior-lisp-program "/usr/local/bin/sbcl")
    ;;(setq slime-contribs '(slime-fancy slime-asdf)) ;;taking out temporarily for clisp
    (setq slime-lisp-implementations
          '((sbcl ("/usr/local/bin/sbcl"))
            (clisp ("/usr/local/bin/clisp")))))
#+end_src

*** Lisp hooks
#+begin_src emacs-lisp
  (add-hook 'lisp-mode-hook #'rainbow-delimiters-mode)
  (add-hook 'lisp-mode-hook #'smartparens-mode)
  (add-hook 'lisp-mode-hook #'turn-on-smartparens-strict-mode)
  (add-hook 'lisp-mode-hook #'eldoc-mode)
  (add-hook 'lisp-mode-hook #'subword-mode)
#+end_src
*** Slime Hooks
#+begin_src emacs-lisp
  (add-hook 'slime-repl-mode-hook #'rainbow-delimiters-mode)
  (add-hook 'slime-repl-mode-hook #'smartparens-mode)
  (add-hook 'slime-repl-mode-hook #'turn-on-smartparens-strict-mode)
#+end_src
** Elisp
*** Hooks
#+begin_src emacs-lisp
  (add-hook 'emacs-lisp-mode-hook #'smartparens-mode)
  (add-hook 'emacs-lisp-mode-hook #'rainbow-delimiters-mode)
  (add-hook 'emacs-lisp-mode-hook #'turn-on-smartparens-strict-mode)
  (add-hook 'emacs-lisp-mode-hook #'eldoc-mode)
  (add-hook 'eval-expression-minibuffer-setup-hook #'eldoc-mode)
  (add-hook 'eval-expression-minibuffer-setup-hook #'smartparens-mode)
  (add-hook 'emacs-lisp-mode-hook #'subword-mode)
#+end_src
** Clojure
Clojure mode.
#+begin_src emacs-lisp
  (use-package clojure-mode
    :straight t
    :config
    (add-hook 'clojure-mode-hook #'smartparens-mode)
    (add-hook 'clojure-mode-hook #'subword-mode)
    (add-hook 'clojure-mode-hook #'rainbow-delimiters-mode)
    (add-hook 'clojure-mode-hook #'turn-on-smartparens-mode)
    (add-hook 'clojure-mode-hook #'turn-on-smartparens-strict-mode))
#+end_src

Gotta have cider.
#+begin_src emacs-lisp
  (use-package cider
    :straight t
    :config
    (setq nrepl-log-messages t)
  (add-hook 'cider-mode-hook #'eldoc-mode)
  (add-hook 'cider-repl-mode-hook #'eldoc-mode)
  (add-hook 'cider-repl-mode-hook #'smartparens-mode)
  (add-hook 'clojure-mode-hook #'rainbow-delimiters-mode)
  (add-hook 'clojure-mode-hook #'turn-on-smartparens-strict-mode))
#+end_src

clj-refactor
#+begin_src emacs-lisp
  (use-package clj-refactor
    :straight t)

  (defun my-clj-refactor-hook ()
    (clj-refactor-mode 1)
    (yas-minor-mode 1)
    (cljr-add-keybindings-with-prefix "C-c C-m"))

  (add-hook 'clojure-mode-hook #'my-clj-refactor-hook)
#+end_src

I'm leaving out flycheck for now, I used to use joker but I'm not sure it's
necessary.
** Groovy
I haven't used Groovy since waaaaay back other than in Jenkinsfiles.
*** Groovy Mode
#+begin_src emacs-lisp
  (use-package groovy-mode
    :straight t
    :config
    (add-to-list 'auto-mode-alist '("Jenkinsfile" . groovy-mode)))
#+end_src
** Golang
*** Imported from original init.. untested
#+begin_src emacs-lisp
  (defun my-go-mode-hook ()
    ;; Call Gofmt before saving
    (add-hook 'before-save-hook 'gofmt-before-save)
     (if (not (string-match "go" compile-command))
        (set (make-local-variable 'compile-command)
             "go build -v && go test -v && go vet")))

  (defun auto-complete-for-go ()
    (auto-complete-mode 1))

  (use-package go-mode
    :straight t
    :config
    (add-hook 'go-mode-hook 'my-go-mode-hook)
    (add-hook 'go-mode-hook 'auto-complete-for-go))
#+end_src

** Kotlin
Experimental, not sure if Kotlin is worth taking a run at in emacs or not with
IntelliJ having first class support :/.
#+begin_src emacs-lisp
  (use-package kotlin-mode
    :straight t)
#+end_src
