settings.el

(require 'org-tempo)

(use-package org-bullets
  :straight t
  :config
  (add-hook 'org-mode-hook #'org-bullets-mode))

(add-hook 'org-mode-hook 'org-indent-mode)

(use-package ob-go
:straight t)
  ;; TODO TEMPORARY I need a solution for managing non-package elisp files
;; this requires manually putting the restclient code in the search path
;; TODO this can probably be a gitsubmodule
(load-file (concat *install-dir* "ob-restclient.el"))
(require 'ob-restclient)
(require 'ob-go)
(require 'ob-clojure)
(require 'ob-js)
(require 'ob-groovy)

(with-eval-after-load 'org
  (org-babel-do-load-languages 'org-babel-load-languages
                                                       '((shell		.	t)
                                                         (lisp		.	t)
                                                         (clojure	.	t)
                                                         (sql		.	t)
                                                         (python	.	t)
                                                         (go		.	t)
                                                         (js		.	t)
                                                         (restclient	.	t)
                                                         (groovy        .       t))))

(setq org-babel-clojure-backend 'cider)

(setq org-log-done 'time)

(use-package magit
  :straight t
  :bind (("C-x g" . magit-status)))

(use-package git-gutter+
  :straight t
  :init (global-git-gutter+-mode))

(use-package exec-path-from-shell
  :straight t
  :config
  (when (memq window-system '(mac ns x))
    (exec-path-from-shell-initialize)))

(use-package which-key
 :straight t)
(which-key-mode)
(which-key-setup-minibuffer)

(use-package avy
  :straight t
  :bind (("C-'" . avy-goto-char-timer)
         ("C-:" . avy-goto-line)))

(key-chord-define-global "sf" 'avy-goto-char-2)

(require 'midnight)
(midnight-delay-set 'midnight-delay "12:00am")

(use-package yasnippet
  :straight t
  :config
  (yas-global-mode 1))

(use-package deft
  :straight t
  :config
  (setq deft-directory "~/notes")
  (setq def-recursive t)
  (setq deft-auto-save-interval 300.0)
  (setq deft-org-mode-title-prefix t)
  (setq deft-use-filename-as-title t)
  (setq deft-default-extension "org"))

(use-package ox-hugo
  :straight t
  :after ox)

(use-package howdoyou
  :straight t)

(use-package free-keys
  :straight t)

(use-package smartparens
  :straight t)

(require 'smartparens-config)

(global-set-key (kbd "C-)") 'sp-forward-slurp-sexp) ;; this shouldn't be always set but for now if it gets me going
(global-set-key (kbd "M-s") 'sp-splice-sexp)

(use-package json-mode
  :straight t)

(use-package yaml-mode
  :straight t
  :mode ("\\.ya?ml\\'" . yaml-mode))

(use-package markdown-mode
  :straight t
  :mode ("\\.md\\'" . markdown-mode))

(use-package slime
  :straight t
  :config
  (setq inferior-lisp-program "/usr/local/bin/sbcl")
  ;;(setq slime-contribs '(slime-fancy slime-asdf)) ;;taking out temporarily for clisp
  (setq slime-lisp-implementations
        '((sbcl ("/usr/local/bin/sbcl"))
          (clisp ("/usr/local/bin/clisp")))))

(add-hook 'lisp-mode-hook #'rainbow-delimiters-mode)
(add-hook 'lisp-mode-hook #'smartparens-mode)
(add-hook 'lisp-mode-hook #'turn-on-smartparens-strict-mode)
(add-hook 'lisp-mode-hook #'eldoc-mode)
(add-hook 'lisp-mode-hook #'subword-mode)

(add-hook 'slime-repl-mode-hook #'rainbow-delimiters-mode)
(add-hook 'slime-repl-mode-hook #'smartparens-mode)
(add-hook 'slime-repl-mode-hook #'turn-on-smartparens-strict-mode)

(add-hook 'emacs-lisp-mode-hook #'smartparens-mode)
(add-hook 'emacs-lisp-mode-hook #'rainbow-delimiters-mode)
(add-hook 'emacs-lisp-mode-hook #'turn-on-smartparens-strict-mode)
(add-hook 'emacs-lisp-mode-hook #'eldoc-mode)
(add-hook 'eval-expression-minibuffer-setup-hook #'eldoc-mode)
(add-hook 'eval-expression-minibuffer-setup-hook #'smartparens-mode)
(add-hook 'emacs-lisp-mode-hook #'subword-mode)

(use-package clojure-mode
  :straight t
  :config
  (add-hook 'clojure-mode-hook #'smartparens-mode)
  (add-hook 'clojure-mode-hook #'subword-mode)
  (add-hook 'clojure-mode-hook #'rainbow-delimiters-mode)
  (add-hook 'clojure-mode-hook #'turn-on-smartparens-mode)
  (add-hook 'clojure-mode-hook #'turn-on-smartparens-strict-mode))

(use-package cider
  :straight t
  :config
  (setq nrepl-log-messages t)
(add-hook 'cider-mode-hook #'eldoc-mode)
(add-hook 'cider-repl-mode-hook #'eldoc-mode)
(add-hook 'cider-repl-mode-hook #'smartparens-mode)
(add-hook 'clojure-mode-hook #'rainbow-delimiters-mode)
(add-hook 'clojure-mode-hook #'turn-on-smartparens-strict-mode))

(use-package clj-refactor
  :straight t)

(defun my-clj-refactor-hook ()
  (clj-refactor-mode 1)
  (yas-minor-mode 1)
  (cljr-add-keybindings-with-prefix "C-c C-m"))

(add-hook 'clojure-mode-hook #'my-clj-refactor-hook)

(use-package groovy-mode
  :straight t
  :config
  (add-to-list 'auto-mode-alist '("Jenkinsfile" . groovy-mode)))

(defun my-go-mode-hook ()
  ;; Call Gofmt before saving
  (add-hook 'before-save-hook 'gofmt-before-save)
   (if (not (string-match "go" compile-command))
      (set (make-local-variable 'compile-command)
           "go build -v && go test -v && go vet")))

(defun auto-complete-for-go ()
  (auto-complete-mode 1))

(use-package go-mode
  :straight t
  :config
  (add-hook 'go-mode-hook 'my-go-mode-hook)
  (add-hook 'go-mode-hook 'auto-complete-for-go))
