settings.org
** Typescript
Require's lsp server for typescript.
npm install -g typescript-language-server
#+begin_src emacs-lisp
  (use-package typescript-mode
    :mode "\\.tsx?\\'"
    :straight t
    :hook (typescript-mode . lsp-deferred) ;; does this work correctly?
    :config (setq typescript-indent-level 2)
    :init
    (add-hook 'typerscript-mode-hook #'smartparens-mode)
    (add-hook 'typescript-mode-hook  #'turn-on-smartparens-strict-mode))
#+end_src

Parse ansi escape codes:

#+begin_src emacs-lisp
  (require 'ansi-color)
  (defun colorize-compilation-buffer ()
    (ansi-color-apply-on-region compilation-filter-start (point-max)))
  (add-hook 'compilation-filter-hook 'colorize-compilation-buffer)
#+end_src

Add a repl for typescript.

#+begin_src emacs-lisp
  (use-package ts-comint
    :straight t
    :init
    (add-hook 'typescript-mode-hook
              (lambda ()
                (local-set-key (kbd "C-x C-e") 'ts-send-last-sexp)
                (local-set-key (kbd "C-M-x") 'ts-send-last-sexp-and-go)
                (local-set-key (kbd "C-c b") 'ts-send-buffer)
                (local-set-key (kbd "C-c C-b") 'ts-send-buffer-and-go)
                (local-set-key (kbd "C-c l") 'ts-load-file-and-go))))
#+end_src

* Misc Functions
** xml format function (stolen from Chris Gore)
#+begin_src emacs-lisp
  (defun xml-format ()
    (interactive)
    (save-excursion
      (shell-command-on-region
       (mark) (point)
       "xmllint --format --encode utf-8 -"
       (buffer-name) t)))
#+end_src

** decode a jwt token
#+begin_src emacs-lisp
  (defun decode-jwt ()
    (interactive)
    (let ((new-buff (get-buffer-create "decoded-jwt.js")))
      (save-excursion
        (shell-command-on-region
         (mark) (point)
         "jq -R 'split(\".\") | .[1] | @base64d | fromjson'"
         new-buff)
        (with-current-buffer new-buff
          (funcall 'javascript-mode))
        (switch-to-buffer new-buff))))
#+end_src

** open multiple eshell buffers
#+begin_src emacs-lisp
  ;; taken from here: https://www.emacswiki.org/emacs/EshellMultipleEshellBuffers#:~:text=Multi%2Deshell,-multi%2Deshell.&text=It%20maintains%20a%20ring%20of,buffer%20in%20the%20shell%20ring.
  (defun eshell-new ()
    "Open a new instance of eshell."
    (interactive)
    (eshell 'N))
#+end_src

* Keep Custom out of this file
This should keep anything handled by customize out of this file.
#+begin_src emacs-lisp
  (setq custom-file (concat *install-dir* "custom.el"))
  (load custom-file)
#+end_src
