settings.el

(defun xml-format ()
  (interactive)
  (save-excursion
    (shell-command-on-region
     (mark) (point)
     "xmllint --format --encode utf-8 -"
     (buffer-name) t)))

(defun decode-jwt ()
  (interactive)
  (let ((new-buff (get-buffer-create "decoded-jwt.js")))
    (save-excursion
      (shell-command-on-region
       (mark) (point)
       "jq -R 'split(\".\") | .[1] | @base64d | fromjson'"
       new-buff)
      (with-current-buffer new-buff
        (funcall 'javascript-mode))
      (switch-to-buffer new-buff))))

;; taken from here: https://www.emacswiki.org/emacs/EshellMultipleEshellBuffers#:~:text=Multi%2Deshell,-multi%2Deshell.&text=It%20maintains%20a%20ring%20of,buffer%20in%20the%20shell%20ring.
(defun eshell-new ()
  "Open a new instance of eshell."
  (interactive)
  (eshell 'N))

(setq custom-file (concat *install-dir* "custom.el"))
(load custom-file)
